# pandas DataFrame 쿼리

DataFrame에서 데이터의 일부를 리턴하는 것을 데이터 슬라이싱(slicing) 또는 다이싱(dicing)이라고 합니다.

pandas DataFrame을 쿼리할때 여러 가지 방법을 사용할 수있습니다.

In [3]:
import pandas as pd

In [4]:
airports = pd.DataFrame([
                        ['Seatte-Tacoma', 'Seattle', 'USA'],
                        ['Dulles', 'Washington', 'USA'],
                        ['London Heathrow', 'London', 'United Kingdom'],
                        ['Schiphol', 'Amsterdam', 'Netherlands'],
                        ['Changi', 'Singapore', 'Singapore'],
                        ['Pearson', 'Toronto', 'Canada'],
                        ['Narita', 'Tokyo', 'Japan']
                        ],
                        columns = ['Name', 'City', 'Country']
                        )
airports

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

## 하나의 column 리턴
리턴 할 column 이름을 지정합니다.
* *DataFrameName*['*columnName*']

In [5]:
airports['City']

0       Seattle
1    Washington
2        London
3     Amsterdam
4     Singapore
5       Toronto
6         Tokyo
Name: City, dtype: object

## 여러 column들을 리턴
반환하려는 열 리스트를 코드에 추가합니다.
* *DataFrameName*[['*FirstColumnName*', '*SecondColumnName*', ...]]

In [7]:
airports[['Name', 'Country']]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan

## *iloc*를 사용하여 반환 할 row와 column 설정
**iloc**[*rows*, *columns*]를 사용하면, row 및 column index 위치의 row 또는, column 그룹을 가져올 수 있습니다.

리턴 할 특정 row와 column을 지정합니다.
* 첫 번째 row는 0 입니다.
* 첫 번째 column은 0 입니다.

In [8]:
# 첫 row와 첫 column의 값을 리턴
airports.iloc[0,0]

'Seatte-Tacoma'

In [9]:
# 세번째 row와 세번째 column을 리턴
airports.iloc[2,2]

'United Kingdom'

*:* 을 지정해서 모든 row들과 column들을 리턴 가능합니다.

In [10]:
airports.iloc[:,:]

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

row 범위 또는 column range를 조회할 수 있습니다.
* [x:y]는 x부터 y까지의 row 또는 column을 리턴합니다.

In [12]:
# 첫 2 row와 모든 column을 리턴
airports.iloc[0:2,:]

            Name        City Country
0  Seatte-Tacoma     Seattle     USA
1         Dulles  Washington     USA

In [17]:
# 모든 row와 첫 두개의 column을 리턴

airports.iloc[:,0:2]

              Name        City
0    Seatte-Tacoma     Seattle
1           Dulles  Washington
2  London Heathrow      London
3         Schiphol   Amsterdam
4           Changi   Singapore
5          Pearson     Toronto
6           Narita       Tokyo

row 리스트 또는 column 리스트를 조회할 수 있습니다.
* [x,y,z]는 row 또는 column x, y 및 z를 반환합니다.

In [18]:
airports.iloc[:,[0,2]]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan

## *loc*를 사용하여 이름으로 column을 조회
column의 index 위치 대신 column 이름을 조회하려면 **iloc** 대신 **loc** 사용

In [19]:
airports.loc[:,['Name', 'Country']]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan